Tekla Open API Reference for Tekla Structures 2025
Line.LineAttributes Constructor
 Creates a new default line attributes instance that loads standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineAttributes()
Public Sub New
See Also
Reference
Line.LineAttributes Class
Line.LineAttributes Overload
Tekla.Structures.Drawing Namespace